{"id": "110hres1027ih", "congress": 110, "bill_type": "hres", "bill_number": 1027, "bill_version": "ih", "title": "Amending the Rules of the House of\n\t\t  Representatives to strike rule XXVIII, popularly known as the Gephardt\n\t\t  rule, and to require recorded votes on measures that increase the\n\t\t  statutory limit on the public debt.", "sections": [{"text": "That rule XXVIII of the Rules of the\t\t\t House of Representatives is amended to read as follows: Rule XXVIII Statutory limit on public\t\t\t\tdebt \nIt shall not be\t\t\t\tin order to agree to a bill, joint resolution, or conference report increasing\t\t\t\tthe statutory limit on the public debt unless the vote upon final passage of\t\t\t\tsuch measure is a recorded\t\t\t\tvote..", "id": "H9D405282E09E4B809074008CF300D1EB", "header": null}], "sections_length": 1, "text": "That rule XXVIII of the Rules of the\t\t\t House of Representatives is amended to read as follows: Rule XXVIII Statutory limit on public\t\t\t\tdebt \nIt shall not be\t\t\t\tin order to agree to a bill, joint resolution, or conference report increasing\t\t\t\tthe statutory limit on the public debt unless the vote upon final passage of\t\t\t\tsuch measure is a recorded\t\t\t\tvote..", "text_length": 360}
{"id": "115hr5131rfs", "congress": 115, "bill_type": "hr", "bill_number": 5131, "bill_version": "rfs", "title": "To improve the effectiveness of Federal efforts to identify and address homeland security risks to\n\t\t\t surface transportation, secure against vehicle-based attacks, and conduct\n\t\t\t a feasibility assessment of introducing new security technologies and\n\t\t\t measures, and for other purposes.", "sections": [{"text": "1. Short title \nThis Act may be cited as the Surface Transportation Security Improvement Act of 2018.", "id": "H274F3E0A424244008BD7BDE27304785C", "header": "Short title"}, {"text": "2. Definitions \nIn this Act: (1) Appropriate congressional committees \nThe term appropriate congressional committees means the Committee on Homeland Security of the House of Representatives and the Committee on Commerce, Science, and Transportation of the Senate. (2) Public and private sector stakeholders \nThe term public and private sector stakeholders has the meaning given such term in section 114(u)(1)(C) of title 49, United States Code. (3) Surface transportation asset \nThe term surface transportation asset includes facilities, equipment, or systems used to provide transportation services by— (A) a public transportation agency (as such term is defined in section 1402(5) of the Implementing Recommendations of the 9/11 Commission Act of 2007 ( Public Law 110–53 ; 6 U.S.C. 1131(5) )); (B) a railroad carrier (as such term is defined in section 20102(3) of title 49, United States Code); (C) an owner or operator of— (i) an entity offering scheduled, fixed-route transportation services by over-the-road bus (as such term is defined in section 1501(4) of the Implementing Recommendations of the 9/11 Commission Act of 2007 ( Public Law 110–53 ; 6 U.S.C. 1151(4) )); or (ii) a bus terminal; or (D) other transportation facilities, equipment, or systems, as determined by the Secretary.", "id": "H77218B2EA8FB460488DF63FE1E499807", "header": "Definitions"}, {"text": "3. National strategy for transportation security review \nNot later than 1 year after the date of the enactment of this Act, the Comptroller General of the United States shall evaluate the degree to which the 2016 Biennial National Strategy for Transportation Security, as required pursuant to section 114(s) of title 49, United States Code, that was issued on August 11, 2016, by the Administrator of the Transportation Security Administration, is reflected in Federal transportation security programs, budgets, research, staffing levels, and related efforts and, in carrying out such evaluation, shall consider the degree to which— (1) such strategy is sufficiently forward-looking to guide future Federal efforts relating to transportation security; (2) Federal transportation security programs, budgets, research, staffing levels, and related efforts for fiscal year 2018 and beyond are guided by such strategy; and (3) the annual progress reports submitted to Congress pursuant to such section subsequent to the issuance of such strategy provide information on the degree to which such strategy guides Federal efforts relating to transportation security.", "id": "HFA2F956E47FD4E7A844BB2C7914FD380", "header": "National strategy for transportation security review"}, {"text": "4. Risk scenarios \n(a) In general \nThe Secretary of Homeland Security shall annually develop, consistent with the transportation modal security plans required under section 114(s) of title 49, United States Code, risk-based priorities based on risk assessments conducted or received by the Secretary across all transportation modes that consider threats, vulnerabilities, and consequences. (b) Scenarios \nThe Secretary of Homeland Security shall ensure that the risk-based priorities identified pursuant to subsection (a) are informed by an analysis of terrorist attack scenarios for each transportation mode, including cyber attack scenarios and intelligence and open source information about current and evolving threats. (c) Report \nNot later than 120 days after each development of risk-based priorities under subsection (a), the Secretary of Homeland Security shall provide to the appropriate congressional committees a report that includes the following: (1) Copies of the risk assessments for each transportation mode. (2) A summary that ranks the risks within and across modes. (3) A description of the risk-based priorities for securing the transportation sector that identifies and prioritizes the greatest security needs of such transportation sector, both across and within modes, in the order that such priorities should be addressed. (4) Information on the underlying methodologies used to assess risks across and within each transportation mode and the basis for any assumptions regarding threats, vulnerabilities, and consequences made in assessing and prioritizing risks within each such mode and across modes. (d) Classification \nThe information provided under subsection (c) may be submitted in a classified format or unclassified format, as appropriate.", "id": "H89927928AAF544DE872F99A1E4639141", "header": "Risk scenarios"}, {"text": "5. Assessments and security plans; Frontline employee security training \n(a) Report \nNot later than 60 days after the date of the enactment of this Act, the Secretary of Homeland Security shall submit to the appropriate congressional committees and the Inspector General of the Department of Homeland Security a report on— (1) the status of regulations requiring assessments and security plans as specified in sections 1405, 1512, and 1531 of the Implementing Recommendations of the 9/11 Commission Act of 2007 ( 6 U.S.C. 1134 , 1162, and 1181) that includes a timeline for the issuance of a final rulemaking subsequent to the December 16, 2016, publication in the Federal Register of an advance notice of proposed rulemaking; and (2) the status of regulations for a security training program to prepare transportation employees for potential security threats and conditions as specified in sections 1408, 1517, and 1534 of the Implementing Recommendations of the 9/11 Commission Act of 2007 ( 6 U.S.C. 1137 , 1167, and 1184) that includes a timeline for the issuance of a final rulemaking subsequent to the December 16, 2016, publication in the Federal Register of a notice of proposed rulemaking. (b) Inspector General review \nNot later than 120 days after submission of the report under subsection (a), the Inspector General of the Department of Homeland Security shall submit to the appropriate congressional committees a review of such report that includes information on— (1) departmental efforts to finalize rulemaking; and (2) recommendations, as necessary, to ensure implementation of the regulations referred to in such subsection.", "id": "H56F6B364126F41DDB3F9F3DDBC63E159", "header": "Assessments and security plans; Frontline employee security training"}, {"text": "6. Research and development \n(a) Emerging issues \nNot later than 180 days after the date of the enactment of this Act, the Secretary of Homeland Security, acting through the Under Secretary for Science and Technology of the Department of Homeland Security and in coordination with the Administrator of the Transportation Security Administration, shall submit to the appropriate congressional committees a feasibility assessment of modifying the security of surface transportation assets by— (1) introducing next generation technologies to be integrated into systems of surface transportation assets to detect explosives, including through the deployment of mobile explosives detection technologies to conduct risk-based passenger and property screening at such systems; (2) providing surface transportation asset operators with access to the Transportation Security Administration’s Secure Flight Program or a similar passenger vetting system maintained by the Transportation Security Administration; (3) deploying a credential authentication technology or other means of identification document inspection to high-risk surface transportation assets to assist operators conducting passenger vetting; and (4) deploying scalable, cost-effective technology solutions to detect chemical, biological, radiological, nuclear, or explosive threats within high-risk surface transportation assets that are capable of passive, continuous, and real-time sensing and detection of, and alerting passengers and operating personnel to, the presence of such a threat. (b) Considerations \nIn carrying out the assessment required under subsection (a), the Secretary of Homeland Security, acting through the Under Secretary for Science and Technology of the Department of Homeland Security and in coordination with the Administrator of the Transportation Security Administration, shall address the technological, privacy, operational, passenger facilitation, and public acceptance considerations involved with each security measure contemplated in such assessment.", "id": "H58012CFC9C86464798F6F4E4AAFA426C", "header": "Research and development"}, {"text": "7. Best practices to secure against vehicle-based attacks \nNot later than 180 days after the date of the enactment of this Act, the Secretary of Homeland Security shall disseminate best practices to public and private sector stakeholders regarding how to enhance transportation security against the threat of a vehicle-based terrorist attack.", "id": "H134AF09AB7654BA6B70DC6A75417AC02", "header": "Best practices to secure against vehicle-based attacks"}, {"text": "8. Surface transportation stakeholder survey \n(a) In general \nNot later than 120 days after the date of the enactment of this Act, the Secretary of Homeland Security shall begin conducting a survey of public and private stakeholders responsible for securing surface transportation assets regarding resource challenges, including the availability of Federal funding, associated with securing such assets that provides an opportunity for respondents to set forth information on specific unmet needs. (b) Report \nNot later than 120 days after beginning the survey required under subsection (a), the Secretary of Homeland Security shall report to the appropriate congressional committees regarding the results of such survey and the Department of Homeland Security’s efforts to address any identified security vulnerabilities.", "id": "H488078DEEA1D4E2194C0A5AC645E1DF9", "header": "Surface transportation stakeholder survey"}, {"text": "9. Innovative technologies and capabilities \n(a) In general \nThe Administrator of the Transportation Security Administration may establish a task force to collaborate with public and private sector stakeholders to identify and develop an innovative technology or capability with the potential to enhance transportation security, including by— (1) conducting a field demonstration of such a technology or capability in an operational environment; (2) gathering performance data from such a demonstration to inform the acquisition process; and (3) to the extent practicable, providing funding and promoting efforts to enable participation in a demonstration by a small business that has an innovative technology or capability but does not have adequate resources to participate in a field demonstration under paragraph (1). (b) Composition \nThe task force authorized under subsection (a) shall be chaired by the Administrator of the Transportation Security Administration’s designee and comprised of representatives appointed by the Administrator, in consultation with the Chairperson of the Aviation Security Advisory Committee (established pursuant to section 44946 of title 49, United States Code). (c) Activities \nThe chair of the task force shall— (1) evaluate technologies and capabilities for field demonstrations with potential to enhance surface transportation security, in addition to technologies and capabilities with potential to enhance aviation security; (2) coordinate with the Science and Technology Directorate of the Department of Homeland Security to leverage such technologies and capabilities; and (3) submit to the Secretary of Homeland Security an annual report regarding the task force’s activities that identifies, for each such technology or capability, what mode of transportation could be enhanced by the integration of such technology or capability into security operations and, as appropriate, plans for deploying such technology or capability. (d) Rule of construction \nNothing in this section shall require the Administrator of the Transportation Security Administration to acquire an innovative technology or capability. (e) Non-Applicability of FACA \nThe Federal Advisory Committee Act (5 U.S.C. App.) shall not apply to the task force.", "id": "H3D847797E84F4536B8F253A1EAE51F9A", "header": "Innovative technologies and capabilities"}, {"text": "10. Security technologies tied to foreign threat countries \nNot later than 180 days after the date of the enactment of this Act, the Secretary of Homeland Security, acting through the Under Secretary for Intelligence and Analysis of the Department of Homeland Security, in consultation with the Under Secretary for the National Protection and Programs Directorate of the Department, shall submit to the appropriate congressional committees an assessment of terrorist and other threats to the transportation sector, including surface transportation assets, posed by the use of security technologies, including software and networked technologies, developed or manufactured by firms that are owned or closely linked to the governments of countries that are known to pose a cyber or homeland security threat.", "id": "H5C0756FCDD2745769FEB37CF2F0725AE", "header": "Security technologies tied to foreign threat countries"}, {"text": "11. Surface transportation security inspectors \n(a) Strategy \nNot later than 180 days after the date of the enactment of this Act, the Administrator of the Transportation Security Administration shall submit to the appropriate congressional committees and the Comptroller General of the United States a strategy to guide operations of surface transportation security inspectors that addresses the following: (1) Any limitations in data systems for such inspectors, as identified by the Comptroller General. (2) Alignment of operations with risk assessment findings, including an approach to identifying and prioritizing entities and locations for inspections. (3) Measurable objectives for the surface transportation security inspectors program. (b) Comptroller General review \nNot later than 180 days after the submission of the strategy required under subsection (b), the Comptroller General of the United States shall review such strategy and, as appropriate, issue recommendations.", "id": "H4C0891B7146E4DAB99CDEE61C9752787", "header": "Surface transportation security inspectors"}], "sections_length": 11, "text": "1. Short title \nThis Act may be cited as the Surface Transportation Security Improvement Act of 2018. 2. Definitions \nIn this Act: (1) Appropriate congressional committees \nThe term appropriate congressional committees means the Committee on Homeland Security of the House of Representatives and the Committee on Commerce, Science, and Transportation of the Senate. (2) Public and private sector stakeholders \nThe term public and private sector stakeholders has the meaning given such term in section 114(u)(1)(C) of title 49, United States Code. (3) Surface transportation asset \nThe term surface transportation asset includes facilities, equipment, or systems used to provide transportation services by— (A) a public transportation agency (as such term is defined in section 1402(5) of the Implementing Recommendations of the 9/11 Commission Act of 2007 ( Public Law 110–53 ; 6 U.S.C. 1131(5) )); (B) a railroad carrier (as such term is defined in section 20102(3) of title 49, United States Code); (C) an owner or operator of— (i) an entity offering scheduled, fixed-route transportation services by over-the-road bus (as such term is defined in section 1501(4) of the Implementing Recommendations of the 9/11 Commission Act of 2007 ( Public Law 110–53 ; 6 U.S.C. 1151(4) )); or (ii) a bus terminal; or (D) other transportation facilities, equipment, or systems, as determined by the Secretary. 3. National strategy for transportation security review \nNot later than 1 year after the date of the enactment of this Act, the Comptroller General of the United States shall evaluate the degree to which the 2016 Biennial National Strategy for Transportation Security, as required pursuant to section 114(s) of title 49, United States Code, that was issued on August 11, 2016, by the Administrator of the Transportation Security Administration, is reflected in Federal transportation security programs, budgets, research, staffing levels, and related efforts and, in carrying out such evaluation, shall consider the degree to which— (1) such strategy is sufficiently forward-looking to guide future Federal efforts relating to transportation security; (2) Federal transportation security programs, budgets, research, staffing levels, and related efforts for fiscal year 2018 and beyond are guided by such strategy; and (3) the annual progress reports submitted to Congress pursuant to such section subsequent to the issuance of such strategy provide information on the degree to which such strategy guides Federal efforts relating to transportation security. 4. Risk scenarios \n(a) In general \nThe Secretary of Homeland Security shall annually develop, consistent with the transportation modal security plans required under section 114(s) of title 49, United States Code, risk-based priorities based on risk assessments conducted or received by the Secretary across all transportation modes that consider threats, vulnerabilities, and consequences. (b) Scenarios \nThe Secretary of Homeland Security shall ensure that the risk-based priorities identified pursuant to subsection (a) are informed by an analysis of terrorist attack scenarios for each transportation mode, including cyber attack scenarios and intelligence and open source information about current and evolving threats. (c) Report \nNot later than 120 days after each development of risk-based priorities under subsection (a), the Secretary of Homeland Security shall provide to the appropriate congressional committees a report that includes the following: (1) Copies of the risk assessments for each transportation mode. (2) A summary that ranks the risks within and across modes. (3) A description of the risk-based priorities for securing the transportation sector that identifies and prioritizes the greatest security needs of such transportation sector, both across and within modes, in the order that such priorities should be addressed. (4) Information on the underlying methodologies used to assess risks across and within each transportation mode and the basis for any assumptions regarding threats, vulnerabilities, and consequences made in assessing and prioritizing risks within each such mode and across modes. (d) Classification \nThe information provided under subsection (c) may be submitted in a classified format or unclassified format, as appropriate. 5. Assessments and security plans; Frontline employee security training \n(a) Report \nNot later than 60 days after the date of the enactment of this Act, the Secretary of Homeland Security shall submit to the appropriate congressional committees and the Inspector General of the Department of Homeland Security a report on— (1) the status of regulations requiring assessments and security plans as specified in sections 1405, 1512, and 1531 of the Implementing Recommendations of the 9/11 Commission Act of 2007 ( 6 U.S.C. 1134 , 1162, and 1181) that includes a timeline for the issuance of a final rulemaking subsequent to the December 16, 2016, publication in the Federal Register of an advance notice of proposed rulemaking; and (2) the status of regulations for a security training program to prepare transportation employees for potential security threats and conditions as specified in sections 1408, 1517, and 1534 of the Implementing Recommendations of the 9/11 Commission Act of 2007 ( 6 U.S.C. 1137 , 1167, and 1184) that includes a timeline for the issuance of a final rulemaking subsequent to the December 16, 2016, publication in the Federal Register of a notice of proposed rulemaking. (b) Inspector General review \nNot later than 120 days after submission of the report under subsection (a), the Inspector General of the Department of Homeland Security shall submit to the appropriate congressional committees a review of such report that includes information on— (1) departmental efforts to finalize rulemaking; and (2) recommendations, as necessary, to ensure implementation of the regulations referred to in such subsection. 6. Research and development \n(a) Emerging issues \nNot later than 180 days after the date of the enactment of this Act, the Secretary of Homeland Security, acting through the Under Secretary for Science and Technology of the Department of Homeland Security and in coordination with the Administrator of the Transportation Security Administration, shall submit to the appropriate congressional committees a feasibility assessment of modifying the security of surface transportation assets by— (1) introducing next generation technologies to be integrated into systems of surface transportation assets to detect explosives, including through the deployment of mobile explosives detection technologies to conduct risk-based passenger and property screening at such systems; (2) providing surface transportation asset operators with access to the Transportation Security Administration’s Secure Flight Program or a similar passenger vetting system maintained by the Transportation Security Administration; (3) deploying a credential authentication technology or other means of identification document inspection to high-risk surface transportation assets to assist operators conducting passenger vetting; and (4) deploying scalable, cost-effective technology solutions to detect chemical, biological, radiological, nuclear, or explosive threats within high-risk surface transportation assets that are capable of passive, continuous, and real-time sensing and detection of, and alerting passengers and operating personnel to, the presence of such a threat. (b) Considerations \nIn carrying out the assessment required under subsection (a), the Secretary of Homeland Security, acting through the Under Secretary for Science and Technology of the Department of Homeland Security and in coordination with the Administrator of the Transportation Security Administration, shall address the technological, privacy, operational, passenger facilitation, and public acceptance considerations involved with each security measure contemplated in such assessment. 7. Best practices to secure against vehicle-based attacks \nNot later than 180 days after the date of the enactment of this Act, the Secretary of Homeland Security shall disseminate best practices to public and private sector stakeholders regarding how to enhance transportation security against the threat of a vehicle-based terrorist attack. 8. Surface transportation stakeholder survey \n(a) In general \nNot later than 120 days after the date of the enactment of this Act, the Secretary of Homeland Security shall begin conducting a survey of public and private stakeholders responsible for securing surface transportation assets regarding resource challenges, including the availability of Federal funding, associated with securing such assets that provides an opportunity for respondents to set forth information on specific unmet needs. (b) Report \nNot later than 120 days after beginning the survey required under subsection (a), the Secretary of Homeland Security shall report to the appropriate congressional committees regarding the results of such survey and the Department of Homeland Security’s efforts to address any identified security vulnerabilities. 9. Innovative technologies and capabilities \n(a) In general \nThe Administrator of the Transportation Security Administration may establish a task force to collaborate with public and private sector stakeholders to identify and develop an innovative technology or capability with the potential to enhance transportation security, including by— (1) conducting a field demonstration of such a technology or capability in an operational environment; (2) gathering performance data from such a demonstration to inform the acquisition process; and (3) to the extent practicable, providing funding and promoting efforts to enable participation in a demonstration by a small business that has an innovative technology or capability but does not have adequate resources to participate in a field demonstration under paragraph (1). (b) Composition \nThe task force authorized under subsection (a) shall be chaired by the Administrator of the Transportation Security Administration’s designee and comprised of representatives appointed by the Administrator, in consultation with the Chairperson of the Aviation Security Advisory Committee (established pursuant to section 44946 of title 49, United States Code). (c) Activities \nThe chair of the task force shall— (1) evaluate technologies and capabilities for field demonstrations with potential to enhance surface transportation security, in addition to technologies and capabilities with potential to enhance aviation security; (2) coordinate with the Science and Technology Directorate of the Department of Homeland Security to leverage such technologies and capabilities; and (3) submit to the Secretary of Homeland Security an annual report regarding the task force’s activities that identifies, for each such technology or capability, what mode of transportation could be enhanced by the integration of such technology or capability into security operations and, as appropriate, plans for deploying such technology or capability. (d) Rule of construction \nNothing in this section shall require the Administrator of the Transportation Security Administration to acquire an innovative technology or capability. (e) Non-Applicability of FACA \nThe Federal Advisory Committee Act (5 U.S.C. App.) shall not apply to the task force. 10. Security technologies tied to foreign threat countries \nNot later than 180 days after the date of the enactment of this Act, the Secretary of Homeland Security, acting through the Under Secretary for Intelligence and Analysis of the Department of Homeland Security, in consultation with the Under Secretary for the National Protection and Programs Directorate of the Department, shall submit to the appropriate congressional committees an assessment of terrorist and other threats to the transportation sector, including surface transportation assets, posed by the use of security technologies, including software and networked technologies, developed or manufactured by firms that are owned or closely linked to the governments of countries that are known to pose a cyber or homeland security threat. 11. Surface transportation security inspectors \n(a) Strategy \nNot later than 180 days after the date of the enactment of this Act, the Administrator of the Transportation Security Administration shall submit to the appropriate congressional committees and the Comptroller General of the United States a strategy to guide operations of surface transportation security inspectors that addresses the following: (1) Any limitations in data systems for such inspectors, as identified by the Comptroller General. (2) Alignment of operations with risk assessment findings, including an approach to identifying and prioritizing entities and locations for inspections. (3) Measurable objectives for the surface transportation security inspectors program. (b) Comptroller General review \nNot later than 180 days after the submission of the strategy required under subsection (b), the Comptroller General of the United States shall review such strategy and, as appropriate, issue recommendations.", "text_length": 13245}
{"id": "115hr6073ih", "congress": 115, "bill_type": "hr", "bill_number": 6073, "bill_version": "ih", "title": "To amend the Rural Electrification Act of 1936 to provide requirements on the use of assistance for\n\t\t\t broadband deployment, and for other purposes.", "sections": [{"text": "1. Short title \nThis Act may be cited as the Reprioritizing Unserved Rural Areas and Locations for Broadband Act of 2018 or the RURAL Broadband Act of 2018.", "id": "H2033C81904904BE1823BCE53853DD65C", "header": "Short title"}, {"text": "2. Use of assistance for deployment of broadband infrastructure \nTitle VI of the Rural Electrification Act of 1936 ( 7 U.S.C. 950bb et seq.) is amended by adding at the end the following: 604. Use of assistance for deployment of broadband infrastructure \n(a) Definition of qualifying broadband-Capable infrastructure \nIn this section, the term qualifying broadband-capable infrastructure means fixed broadband-capable infrastructure— (1) used by a service provider to provide fixed broadband service for which the service provider receives universal service support under section 254 of the Communications Act of 1934 ( 47 U.S.C. 254 ), if— (A) the broadband service satisfies any applicable broadband speed standards under that section and the regulations issued under that section; or (B) the service provider is in compliance with buildout obligations to provide retail fixed broadband service that will comply with applicable broadband speed standards described in subparagraph (A); or (2) that— (A) was financed with funds provided by the Secretary under this Act or any other program carried out by the Secretary for the costs of the construction, improvement, or acquisition of facilities or equipment for the purpose of providing fixed telecommunications or broadband service; and (B) (i) is used to provide fixed broadband service, if— (I) the broadband service satisfies any applicable broadband speed standards established by the Secretary; or (II) the service provider is in compliance with buildout obligations to provide retail fixed broadband service that will comply with applicable broadband speed standards described in subclause (I); or (ii) was financed with a loan under this Act or any other program carried out by the Secretary that remains outstanding. (b) Restriction on use of assistance \nA loan, grant, or other assistance awarded under this Act, or by the rural development mission area under the Consolidated Farm and Rural Development Act ( 7 U.S.C. 1921 et seq.), may not be used to coordinate, approve, or finance the deployment of broadband-capable infrastructure by a service provider to provide retail fixed broadband service that would overbuild or otherwise duplicate qualifying broadband-capable infrastructure that another service provider is using to provide retail fixed broadband service in the same area. (c) Use of assistance in unserved areas \nA loan, grant, or other assistance provided by the Secretary, acting through the Administrator of the Rural Utilities Service, to coordinate, approve, or finance the deployment of broadband-capable infrastructure by a service provider may be used to provide retail fixed broadband service in an area in which there is no qualifying broadband-capable infrastructure owned or operated by another service provider..", "id": "H9EA43CB241A34B6AA946E2AC81A7D270", "header": "Use of assistance for deployment of broadband infrastructure"}, {"text": "604. Use of assistance for deployment of broadband infrastructure \n(a) Definition of qualifying broadband-Capable infrastructure \nIn this section, the term qualifying broadband-capable infrastructure means fixed broadband-capable infrastructure— (1) used by a service provider to provide fixed broadband service for which the service provider receives universal service support under section 254 of the Communications Act of 1934 ( 47 U.S.C. 254 ), if— (A) the broadband service satisfies any applicable broadband speed standards under that section and the regulations issued under that section; or (B) the service provider is in compliance with buildout obligations to provide retail fixed broadband service that will comply with applicable broadband speed standards described in subparagraph (A); or (2) that— (A) was financed with funds provided by the Secretary under this Act or any other program carried out by the Secretary for the costs of the construction, improvement, or acquisition of facilities or equipment for the purpose of providing fixed telecommunications or broadband service; and (B) (i) is used to provide fixed broadband service, if— (I) the broadband service satisfies any applicable broadband speed standards established by the Secretary; or (II) the service provider is in compliance with buildout obligations to provide retail fixed broadband service that will comply with applicable broadband speed standards described in subclause (I); or (ii) was financed with a loan under this Act or any other program carried out by the Secretary that remains outstanding. (b) Restriction on use of assistance \nA loan, grant, or other assistance awarded under this Act, or by the rural development mission area under the Consolidated Farm and Rural Development Act ( 7 U.S.C. 1921 et seq.), may not be used to coordinate, approve, or finance the deployment of broadband-capable infrastructure by a service provider to provide retail fixed broadband service that would overbuild or otherwise duplicate qualifying broadband-capable infrastructure that another service provider is using to provide retail fixed broadband service in the same area. (c) Use of assistance in unserved areas \nA loan, grant, or other assistance provided by the Secretary, acting through the Administrator of the Rural Utilities Service, to coordinate, approve, or finance the deployment of broadband-capable infrastructure by a service provider may be used to provide retail fixed broadband service in an area in which there is no qualifying broadband-capable infrastructure owned or operated by another service provider.", "id": "H88767ECCD6A04F038C1959ED12C228FA", "header": "Use of assistance for deployment of broadband infrastructure"}], "sections_length": 3, "text": "1. Short title \nThis Act may be cited as the Reprioritizing Unserved Rural Areas and Locations for Broadband Act of 2018 or the RURAL Broadband Act of 2018. 2. Use of assistance for deployment of broadband infrastructure \nTitle VI of the Rural Electrification Act of 1936 ( 7 U.S.C. 950bb et seq.) is amended by adding at the end the following: 604. Use of assistance for deployment of broadband infrastructure \n(a) Definition of qualifying broadband-Capable infrastructure \nIn this section, the term qualifying broadband-capable infrastructure means fixed broadband-capable infrastructure— (1) used by a service provider to provide fixed broadband service for which the service provider receives universal service support under section 254 of the Communications Act of 1934 ( 47 U.S.C. 254 ), if— (A) the broadband service satisfies any applicable broadband speed standards under that section and the regulations issued under that section; or (B) the service provider is in compliance with buildout obligations to provide retail fixed broadband service that will comply with applicable broadband speed standards described in subparagraph (A); or (2) that— (A) was financed with funds provided by the Secretary under this Act or any other program carried out by the Secretary for the costs of the construction, improvement, or acquisition of facilities or equipment for the purpose of providing fixed telecommunications or broadband service; and (B) (i) is used to provide fixed broadband service, if— (I) the broadband service satisfies any applicable broadband speed standards established by the Secretary; or (II) the service provider is in compliance with buildout obligations to provide retail fixed broadband service that will comply with applicable broadband speed standards described in subclause (I); or (ii) was financed with a loan under this Act or any other program carried out by the Secretary that remains outstanding. (b) Restriction on use of assistance \nA loan, grant, or other assistance awarded under this Act, or by the rural development mission area under the Consolidated Farm and Rural Development Act ( 7 U.S.C. 1921 et seq.), may not be used to coordinate, approve, or finance the deployment of broadband-capable infrastructure by a service provider to provide retail fixed broadband service that would overbuild or otherwise duplicate qualifying broadband-capable infrastructure that another service provider is using to provide retail fixed broadband service in the same area. (c) Use of assistance in unserved areas \nA loan, grant, or other assistance provided by the Secretary, acting through the Administrator of the Rural Utilities Service, to coordinate, approve, or finance the deployment of broadband-capable infrastructure by a service provider may be used to provide retail fixed broadband service in an area in which there is no qualifying broadband-capable infrastructure owned or operated by another service provider.. 604. Use of assistance for deployment of broadband infrastructure \n(a) Definition of qualifying broadband-Capable infrastructure \nIn this section, the term qualifying broadband-capable infrastructure means fixed broadband-capable infrastructure— (1) used by a service provider to provide fixed broadband service for which the service provider receives universal service support under section 254 of the Communications Act of 1934 ( 47 U.S.C. 254 ), if— (A) the broadband service satisfies any applicable broadband speed standards under that section and the regulations issued under that section; or (B) the service provider is in compliance with buildout obligations to provide retail fixed broadband service that will comply with applicable broadband speed standards described in subparagraph (A); or (2) that— (A) was financed with funds provided by the Secretary under this Act or any other program carried out by the Secretary for the costs of the construction, improvement, or acquisition of facilities or equipment for the purpose of providing fixed telecommunications or broadband service; and (B) (i) is used to provide fixed broadband service, if— (I) the broadband service satisfies any applicable broadband speed standards established by the Secretary; or (II) the service provider is in compliance with buildout obligations to provide retail fixed broadband service that will comply with applicable broadband speed standards described in subclause (I); or (ii) was financed with a loan under this Act or any other program carried out by the Secretary that remains outstanding. (b) Restriction on use of assistance \nA loan, grant, or other assistance awarded under this Act, or by the rural development mission area under the Consolidated Farm and Rural Development Act ( 7 U.S.C. 1921 et seq.), may not be used to coordinate, approve, or finance the deployment of broadband-capable infrastructure by a service provider to provide retail fixed broadband service that would overbuild or otherwise duplicate qualifying broadband-capable infrastructure that another service provider is using to provide retail fixed broadband service in the same area. (c) Use of assistance in unserved areas \nA loan, grant, or other assistance provided by the Secretary, acting through the Administrator of the Rural Utilities Service, to coordinate, approve, or finance the deployment of broadband-capable infrastructure by a service provider may be used to provide retail fixed broadband service in an area in which there is no qualifying broadband-capable infrastructure owned or operated by another service provider.", "text_length": 5571}
{"id": "116hr522ih", "congress": 116, "bill_type": "hr", "bill_number": 522, "bill_version": "ih", "title": "To prohibit the creation of manufactured emergencies in order to build border walls.", "sections": [{"text": "1. Short title \nThis Act may be cited as the No Walls Act.", "id": "H4EB6E6B879F04DC4BCE4793EE979BECC", "header": "Short title"}, {"text": "2. No national emergency declarations for border walls during shutdowns \n(a) In general \nNo funds made available by any act of law may be used to declare a national emergency with respect to immigration concerns at America’s southern border with Mexico or to erect any new border barriers, including fencing or walls, pursuant to a declaration of a national emergency. (b) Applicability \nSubsection (a) shall be enforced during periods in which any Federal agency experiences a lapse in appropriations.", "id": "id0EA722A8908A48F48BB55629D3195EA6", "header": "No national emergency declarations for border walls during shutdowns"}], "sections_length": 2, "text": "1. Short title \nThis Act may be cited as the No Walls Act. 2. No national emergency declarations for border walls during shutdowns \n(a) In general \nNo funds made available by any act of law may be used to declare a national emergency with respect to immigration concerns at America’s southern border with Mexico or to erect any new border barriers, including fencing or walls, pursuant to a declaration of a national emergency. (b) Applicability \nSubsection (a) shall be enforced during periods in which any Federal agency experiences a lapse in appropriations.", "text_length": 561}
{"id": "116hr3683ih", "congress": 116, "bill_type": "hr", "bill_number": 3683, "bill_version": "ih", "title": "To amend the Central Intelligence Agency Act of 1949 to provide death benefits to the survivors of\n\t\t\t certain individuals, and for other purposes.", "sections": [{"text": "1. Short title \nThis Act may be cited as the Gregg Wenzel Clandestine Heroes Parity Act.", "id": "H25A75E8BA2DD45F6A77267F617166BE1", "header": "Short title"}, {"text": "2. Death benefits for survivors \n(a) Sense of Congress \nIt is the sense of Congress that— (1) officers of the Central Intelligence Agency who die during a period of assignment to a duty station in a foreign country should receive death benefits, regardless of whether the officers— (A) were killed in the performance of duty; (B) were killed due to an act of terrorism; or (C) have surviving dependents; and (2) section 8 of the Central Intelligence Agency Act of 1949 ( 50 U.S.C. 3510 ) has provided the Agency an appropriate authority for compensating officers who die abroad who fall into any gaps in existing death benefit regulations of the Agency, even before the clarifying amendments made by this Act. (b) Clarification of current authority \nSection 8 of the Central Intelligence Agency Act of 1949 ( 50 U.S.C. 3510 ) is amended by inserting before rental of the following: payment of death benefits in cases in which the circumstances of the death of an employee of the Agency is not covered by section 11, other similar provisions of Federal law, or any regulation issued by the Director providing death benefits, but that the Director determines such payment appropriate;. (c) Improvements to benefits \n(1) Requirements \nSection 11 of such Act ( 50 U.S.C. 3511 ) is amended— (A) in subsection (a)— (i) by striking may and inserting shall ; and (ii) by inserting before the period at the end the following: , except such adjustments may not limit or reduce the payments required by this section ; and (B) by adding at the end the following new subsections: (c) Payments \n(1) In carrying out subsection (a), the Director shall pay to the survivor of a deceased covered individual an amount equal to one year's salary at level II of the Executive Schedule under section 5313 of title 5, United States Code. (2) A covered individual may designate one or more persons to receive all or a portion of the amount payable to a survivor under paragraph (1). The designation of a person to receive a portion of the amount shall indicate the percentage of the amount, to be specified only in 10 percent increments, that the designated person may receive. The balance of the amount, if any, shall be paid in accordance with subsection (f)(2)(B). (d) Exception \nThe Director may not make a payment under subsection (a) if the Director determines that the death was by reason of willful misconduct by the decedent. (e) Finality \nAny determination made by the Director under this section is final and may not be reviewed. (f) Definitions \nIn this section: (1) The term covered individual means any of the following individuals who die during a period of assignment to a duty station in a foreign country, regardless of whether the death is the result of injuries sustained while in the performance of duty: (A) An employee of the Agency. (B) An employee of an element of the Federal Government other than the Agency who is detailed or assigned to the Agency at the time of death. (C) An individual affiliated with the Agency, as determined by the Director. (2) The term State means each of the several States, the District of Columbia, the Commonwealth of Puerto Rico, the Commonwealth of the Northern Mariana Islands, and any territory or possession of the United States. (3) The term survivor means, with respect to the death of a covered individual— (A) a person designated by the covered individual under subsection (c)(2); or (B) if a covered individual does not make such a designation— (i) the surviving spouse of the covered individual, if any; (ii) if there is no surviving spouse, any surviving children of the covered individual and the descendants of any deceased children by representation; (iii) if there is none of the above, the surviving parents of the covered individual or the survivor of the parents; (iv) if there is none of the above, the duly appointed executor or administrator of the estate of the covered individual; or (v) if there is none of the above, other next of kin of the covered individual entitled under the laws of the last State in which the covered individual was domiciled before the covered individual’s death.. (2) Application \nSection 11 of such Act, as amended by paragraph (1), shall apply with respect to the following: (A) Deaths occurring during the period beginning on September 11, 2001, and ending on the day before the date of the enactment of this Act for which the Director of the Central Intelligence Agency has not paid a death benefit to the survivors of the decedent equal to or greater than the amount specified in subsection (c)(1) of such section 11, except that the total of any such death benefits may not exceed such amount specified in subsection (c)(1) of such section 11. (B) Deaths occurring on or after the date of the enactment of this Act. (3) Effect of current regulations \nIn carrying out section 11 of such Act, as amended by paragraph (1), the Director may not modify the regulations issued under such section in a manner that limits or reduces the individuals covered by such regulations as in effect on the day before the date of the enactment of this Act. (4) Designations \nNot later than 180 days after the date of the enactment of this Act, the Director shall— (A) request all covered individuals (as defined in section 11 of such Act, as amended by paragraph (1)) to make a designation under subsection (c)(2) of such section 11; and (B) ensure that any new covered individual may make such a designation at the time at which the individual becomes a covered individual.", "id": "H258F61C967A0404CA7AED6C5B44D4CFC", "header": "Death benefits for survivors"}], "sections_length": 2, "text": "1. Short title \nThis Act may be cited as the Gregg Wenzel Clandestine Heroes Parity Act. 2. Death benefits for survivors \n(a) Sense of Congress \nIt is the sense of Congress that— (1) officers of the Central Intelligence Agency who die during a period of assignment to a duty station in a foreign country should receive death benefits, regardless of whether the officers— (A) were killed in the performance of duty; (B) were killed due to an act of terrorism; or (C) have surviving dependents; and (2) section 8 of the Central Intelligence Agency Act of 1949 ( 50 U.S.C. 3510 ) has provided the Agency an appropriate authority for compensating officers who die abroad who fall into any gaps in existing death benefit regulations of the Agency, even before the clarifying amendments made by this Act. (b) Clarification of current authority \nSection 8 of the Central Intelligence Agency Act of 1949 ( 50 U.S.C. 3510 ) is amended by inserting before rental of the following: payment of death benefits in cases in which the circumstances of the death of an employee of the Agency is not covered by section 11, other similar provisions of Federal law, or any regulation issued by the Director providing death benefits, but that the Director determines such payment appropriate;. (c) Improvements to benefits \n(1) Requirements \nSection 11 of such Act ( 50 U.S.C. 3511 ) is amended— (A) in subsection (a)— (i) by striking may and inserting shall ; and (ii) by inserting before the period at the end the following: , except such adjustments may not limit or reduce the payments required by this section ; and (B) by adding at the end the following new subsections: (c) Payments \n(1) In carrying out subsection (a), the Director shall pay to the survivor of a deceased covered individual an amount equal to one year's salary at level II of the Executive Schedule under section 5313 of title 5, United States Code. (2) A covered individual may designate one or more persons to receive all or a portion of the amount payable to a survivor under paragraph (1). The designation of a person to receive a portion of the amount shall indicate the percentage of the amount, to be specified only in 10 percent increments, that the designated person may receive. The balance of the amount, if any, shall be paid in accordance with subsection (f)(2)(B). (d) Exception \nThe Director may not make a payment under subsection (a) if the Director determines that the death was by reason of willful misconduct by the decedent. (e) Finality \nAny determination made by the Director under this section is final and may not be reviewed. (f) Definitions \nIn this section: (1) The term covered individual means any of the following individuals who die during a period of assignment to a duty station in a foreign country, regardless of whether the death is the result of injuries sustained while in the performance of duty: (A) An employee of the Agency. (B) An employee of an element of the Federal Government other than the Agency who is detailed or assigned to the Agency at the time of death. (C) An individual affiliated with the Agency, as determined by the Director. (2) The term State means each of the several States, the District of Columbia, the Commonwealth of Puerto Rico, the Commonwealth of the Northern Mariana Islands, and any territory or possession of the United States. (3) The term survivor means, with respect to the death of a covered individual— (A) a person designated by the covered individual under subsection (c)(2); or (B) if a covered individual does not make such a designation— (i) the surviving spouse of the covered individual, if any; (ii) if there is no surviving spouse, any surviving children of the covered individual and the descendants of any deceased children by representation; (iii) if there is none of the above, the surviving parents of the covered individual or the survivor of the parents; (iv) if there is none of the above, the duly appointed executor or administrator of the estate of the covered individual; or (v) if there is none of the above, other next of kin of the covered individual entitled under the laws of the last State in which the covered individual was domiciled before the covered individual’s death.. (2) Application \nSection 11 of such Act, as amended by paragraph (1), shall apply with respect to the following: (A) Deaths occurring during the period beginning on September 11, 2001, and ending on the day before the date of the enactment of this Act for which the Director of the Central Intelligence Agency has not paid a death benefit to the survivors of the decedent equal to or greater than the amount specified in subsection (c)(1) of such section 11, except that the total of any such death benefits may not exceed such amount specified in subsection (c)(1) of such section 11. (B) Deaths occurring on or after the date of the enactment of this Act. (3) Effect of current regulations \nIn carrying out section 11 of such Act, as amended by paragraph (1), the Director may not modify the regulations issued under such section in a manner that limits or reduces the individuals covered by such regulations as in effect on the day before the date of the enactment of this Act. (4) Designations \nNot later than 180 days after the date of the enactment of this Act, the Director shall— (A) request all covered individuals (as defined in section 11 of such Act, as amended by paragraph (1)) to make a designation under subsection (c)(2) of such section 11; and (B) ensure that any new covered individual may make such a designation at the time at which the individual becomes a covered individual.", "text_length": 5635}
{"id": "117hres479rh", "congress": 117, "bill_type": "hres", "bill_number": 479, "bill_version": "rh", "title": "Providing for consideration of the bill (S. 475) to amend title 5, United States Code, to designate Juneteenth National Independence Day as a legal public holiday.", "sections": [{"text": "That upon adoption of this resolution it shall be in order to consider in the House the bill (S. 475) to amend title 5, United States Code, to designate Juneteenth National Independence Day as a legal public holiday. All points of order against consideration of the bill are waived. The bill shall be considered as read. All points of order against provisions in the bill are waived. The previous question shall be considered as ordered on the bill and on any amendment thereto to final passage without intervening motion except: (1) one hour of debate equally divided and controlled by the chair and ranking minority member of the Committee on Oversight and Reform or their respective designees; and (2) one motion to commit.", "id": "H22062D4E391E4C20A2EA9C896F5E9493", "header": null}], "sections_length": 1, "text": "That upon adoption of this resolution it shall be in order to consider in the House the bill (S. 475) to amend title 5, United States Code, to designate Juneteenth National Independence Day as a legal public holiday. All points of order against consideration of the bill are waived. The bill shall be considered as read. All points of order against provisions in the bill are waived. The previous question shall be considered as ordered on the bill and on any amendment thereto to final passage without intervening motion except: (1) one hour of debate equally divided and controlled by the chair and ranking minority member of the Committee on Oversight and Reform or their respective designees; and (2) one motion to commit.", "text_length": 726}
{"id": "117s5131is", "congress": 117, "bill_type": "s", "bill_number": 5131, "bill_version": "is", "title": "To ensure that certain loan programs of the Small Business Administration are made available to cannabis-related legitimate businesses and service providers, and for other purposes.", "sections": [{"text": "1. Short title \nThis Act may be cited as the Fair Access for Cannabis Small Businesses Act.", "id": "HB11D8E200D0443C999C80A06CE09314C", "header": "Short title"}, {"text": "2. 7 (a) loans to cannabis-related legitimate businesses and service providers \nSection 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ) is amended by adding at the end the following: (38) Loans to cannabis-related legitimate businesses and service providers \n(A) Definitions \nIn this paragraph: (i) Cannabis \nThe term cannabis has the meaning given the term marihuana in section 102 of the Controlled Substances Act ( 21 U.S.C. 802 ). (ii) Cannabis product \nThe term cannabis product means any article that contains cannabis, including an article that is a concentrate, an edible, a tincture, a cannabis-infused product, or a topical. (iii) Cannabis-related legitimate business \nThe term cannabis-related legitimate business means a manufacturer, producer, or any person or company that is a small business concern and that— (I) engages in any activity described in subclause (II) pursuant to a law established by a State or a political subdivision of a State, as determined by the State or political subdivision; and (II) participates in any business or organized activity that involves handling cannabis or cannabis products, including cultivating, producing, manufacturing, selling, transporting, displaying, dispensing, distributing, or purchasing cannabis or cannabis products. (iv) Manufacturer \nThe term manufacturer means a person who manufactures, compounds, converts, processes, prepares, or packages cannabis or cannabis products. (v) Producer \nThe term producer means a person who plants, cultivates, harvests, or in any way facilitates the natural growth of cannabis. (vi) Service provider \nThe term service provider — (I) means a business, organization, or other person that— (aa) sells goods or services to a cannabis-related legitimate business; or (bb) provides any business services, including the sale or lease of real or any other property, legal or other licensed services, or any other ancillary service, relating to cannabis; and (II) does not include a business, organization, or other person that participates in any business or organized activity that involves handling cannabis or cannabis products, including cultivating, producing, manufacturing, selling, transporting, displaying, dispensing, distributing, or purchasing cannabis or cannabis products. (vii) State \nThe term State means each of the several States, the District of Columbia, Puerto Rico, and any territory or possession of the United States. (B) Loans \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not decline to provide a guarantee for a loan under this subsection, and a lender may not decline to make a loan made under this subsection, to an otherwise eligible small business concern solely because the concern is a cannabis-related legitimate business or service provider..", "id": "HED6E2CC946F747B2964ED3A4F5BB91D2", "header": "7(a) loans to cannabis-related legitimate businesses and service providers"}, {"text": "3. Disaster loans to cannabis-related legitimate businesses and service providers \nSection 7(b) of the Small Business Act ( 15 U.S.C. 636(b) ) is amended by inserting after paragraph (15) the following: (16) Assistance to cannabis-related legitimate businesses and service providers \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not decline to provide assistance under this subsection to an otherwise eligible borrower solely because the borrower is a cannabis-related legitimate business or service provider (as defined in subsection (a)(38))..", "id": "H141E3809240B44B2811BDF16D5225BFF", "header": "Disaster loans to cannabis-related legitimate businesses and service providers"}, {"text": "4. Microloans to cannabis-related legitimate businesses and service providers \nSection 7(m) of the Small Business Act ( 15 U.S.C. 636(m)(13) ) is amended by adding at the end the following: (14) Assistance to cannabis-related legitimate businesses and service providers \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not prohibit an eligible intermediary from providing assistance under this subsection to an otherwise eligible borrower solely because the borrower is a cannabis-related legitimate business or service provider (as defined in subsection (a)(38))..", "id": "H29DADEC8CE84411D9AABE03CDE101D40", "header": "Microloans to cannabis-related legitimate businesses and service providers"}, {"text": "5. Small business investment company debentures to finance cannabis-related legitimate businesses and service providers \nPart A of title III of the Small Business Investment Act of 1958 ( 15 U.S.C. 681 et seq. ) is amended by adding at the end the following: 321. Debentures to finance cannabis-related legitimate businesses and service providers \n(a) Guarantees \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not decline to purchase or guarantee a debenture issued under this title to an otherwise eligible small business investment company solely because the small business investment company provides financing to an entity that is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ). (b) Other assistance \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not prohibit a small business investment company from providing assistance under this title to an otherwise eligible small business concern solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) )..", "id": "H3142C9B0D84B477DB48597C63156A3E4", "header": "Small business investment company debentures to finance cannabis-related legitimate businesses and service providers"}, {"text": "321. Debentures to finance cannabis-related legitimate businesses and service providers \n(a) Guarantees \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not decline to purchase or guarantee a debenture issued under this title to an otherwise eligible small business investment company solely because the small business investment company provides financing to an entity that is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ). (b) Other assistance \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not prohibit a small business investment company from providing assistance under this title to an otherwise eligible small business concern solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ).", "id": "HEF21D76D06DD437FACF11CE5ED3599AA", "header": "Debentures to finance cannabis-related legitimate businesses and service providers"}, {"text": "6. State or local development company loans to finance cannabis-related legitimate businesses and service providers \nTitle V of the Small Business Investment Act of 1958 ( 15 U.S.C. 695 et seq. ) is amended by adding at the end the following: 511. Loans to finance cannabis-related legitimate businesses and service providers \n(a) Guarantees \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not decline to guarantee a debenture issued under this title for the purpose of making 1 or more loans to small business concerns solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ). (b) Other assistance \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), a qualified State or local development company may not decline an application for a loan under this title submitted by an otherwise eligible small business concern solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) )..", "id": "H20C856920540438EB36B49C9E3404CDA", "header": "State or local development company loans to finance cannabis-related legitimate businesses and service providers"}, {"text": "511. Loans to finance cannabis-related legitimate businesses and service providers \n(a) Guarantees \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not decline to guarantee a debenture issued under this title for the purpose of making 1 or more loans to small business concerns solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ). (b) Other assistance \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), a qualified State or local development company may not decline an application for a loan under this title submitted by an otherwise eligible small business concern solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ).", "id": "H2D5863FA946B4BE69B592F2979DA0704", "header": "Loans to finance cannabis-related legitimate businesses and service providers"}, {"text": "7. Assistance from resource partners for cannabis-related legitimate businesses and service providers \n(a) Small business development centers \nSection 21(c) of the Small Business Act ( 15 U.S.C. 648(c) ) is amended by adding at the end the following: (9) Services for cannabis-related legitimate businesses and service providers \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), a small business development center may not decline to provide services to an otherwise eligible small business concern under this section solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in section 7(a)(38)).. (b) Women’s business centers \nSection 29 of the Small Business Act ( 15 U.S.C. 656 ) is amended by adding at the end the following: (p) Services for cannabis-Related legitimate businesses and service providers \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), a women’s business center may not decline to provide services to an otherwise eligible small business concern under this section solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in section 7(a)(38)).. (c) SCORE \nSection 8(b)(1)(B) of the Small Business Act ( 15 U.S.C. 637(b)(1)(B) ) is amended by adding at the end the following: Notwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the head of the SCORE program established under this subparagraph may not decline to provide services to an otherwise eligible small business concern solely because the concern is a cannabis-related legitimate business or service provider (as defined in section 7(a)(38)).. (d) Veteran business outreach centers \nSection 32 of the Small Business Act ( 15 U.S.C. 657b ) is amended by adding at the end the following: (h) Services for cannabis-Related legitimate businesses and service providers \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), a Veteran Business Outreach Center may not decline to provide services to an otherwise eligible small business concern under this section solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in section 7(a)(38))..", "id": "idA3371313BC6F48B38E9880500785FFF8", "header": "Assistance from resource partners for cannabis-related legitimate businesses and service providers"}, {"text": "8. Technical assistance providers \nIn addition to the programs covered by the amendments made by this Act, and notwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), a provider of financial or technical assistance under a program administered or funded by the Small Business Administration may not decline to provide such financial or technical assistance to an otherwise eligible small business concern (as defined in section 3 of the Small Business Act ( 15 U.S.C. 632 )) solely because the concern is a cannabis-related legitimate business or service provider (as defined in section 7(a)(38) of the Small Business Act ( 15 U.S.C. 636(a)(38) ).", "id": "H21A8936EAFFD4536971AC16D93511DA0", "header": "Technical assistance providers"}, {"text": "9. Rulemaking \nNot later than 120 days after the date of enactment of this Act, the Administrator of the Small Business Administration shall issue or amend any rules, standard operating procedures, and other legal or policy guidance as necessary to carry out the requirements of this Act and the amendments made by this Act.", "id": "id68EF518407D948A4BB35B52AA8009918", "header": "Rulemaking"}], "sections_length": 11, "text": "1. Short title \nThis Act may be cited as the Fair Access for Cannabis Small Businesses Act. 2. 7 (a) loans to cannabis-related legitimate businesses and service providers \nSection 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ) is amended by adding at the end the following: (38) Loans to cannabis-related legitimate businesses and service providers \n(A) Definitions \nIn this paragraph: (i) Cannabis \nThe term cannabis has the meaning given the term marihuana in section 102 of the Controlled Substances Act ( 21 U.S.C. 802 ). (ii) Cannabis product \nThe term cannabis product means any article that contains cannabis, including an article that is a concentrate, an edible, a tincture, a cannabis-infused product, or a topical. (iii) Cannabis-related legitimate business \nThe term cannabis-related legitimate business means a manufacturer, producer, or any person or company that is a small business concern and that— (I) engages in any activity described in subclause (II) pursuant to a law established by a State or a political subdivision of a State, as determined by the State or political subdivision; and (II) participates in any business or organized activity that involves handling cannabis or cannabis products, including cultivating, producing, manufacturing, selling, transporting, displaying, dispensing, distributing, or purchasing cannabis or cannabis products. (iv) Manufacturer \nThe term manufacturer means a person who manufactures, compounds, converts, processes, prepares, or packages cannabis or cannabis products. (v) Producer \nThe term producer means a person who plants, cultivates, harvests, or in any way facilitates the natural growth of cannabis. (vi) Service provider \nThe term service provider — (I) means a business, organization, or other person that— (aa) sells goods or services to a cannabis-related legitimate business; or (bb) provides any business services, including the sale or lease of real or any other property, legal or other licensed services, or any other ancillary service, relating to cannabis; and (II) does not include a business, organization, or other person that participates in any business or organized activity that involves handling cannabis or cannabis products, including cultivating, producing, manufacturing, selling, transporting, displaying, dispensing, distributing, or purchasing cannabis or cannabis products. (vii) State \nThe term State means each of the several States, the District of Columbia, Puerto Rico, and any territory or possession of the United States. (B) Loans \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not decline to provide a guarantee for a loan under this subsection, and a lender may not decline to make a loan made under this subsection, to an otherwise eligible small business concern solely because the concern is a cannabis-related legitimate business or service provider.. 3. Disaster loans to cannabis-related legitimate businesses and service providers \nSection 7(b) of the Small Business Act ( 15 U.S.C. 636(b) ) is amended by inserting after paragraph (15) the following: (16) Assistance to cannabis-related legitimate businesses and service providers \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not decline to provide assistance under this subsection to an otherwise eligible borrower solely because the borrower is a cannabis-related legitimate business or service provider (as defined in subsection (a)(38)).. 4. Microloans to cannabis-related legitimate businesses and service providers \nSection 7(m) of the Small Business Act ( 15 U.S.C. 636(m)(13) ) is amended by adding at the end the following: (14) Assistance to cannabis-related legitimate businesses and service providers \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not prohibit an eligible intermediary from providing assistance under this subsection to an otherwise eligible borrower solely because the borrower is a cannabis-related legitimate business or service provider (as defined in subsection (a)(38)).. 5. Small business investment company debentures to finance cannabis-related legitimate businesses and service providers \nPart A of title III of the Small Business Investment Act of 1958 ( 15 U.S.C. 681 et seq. ) is amended by adding at the end the following: 321. Debentures to finance cannabis-related legitimate businesses and service providers \n(a) Guarantees \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not decline to purchase or guarantee a debenture issued under this title to an otherwise eligible small business investment company solely because the small business investment company provides financing to an entity that is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ). (b) Other assistance \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not prohibit a small business investment company from providing assistance under this title to an otherwise eligible small business concern solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ).. 321. Debentures to finance cannabis-related legitimate businesses and service providers \n(a) Guarantees \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not decline to purchase or guarantee a debenture issued under this title to an otherwise eligible small business investment company solely because the small business investment company provides financing to an entity that is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ). (b) Other assistance \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not prohibit a small business investment company from providing assistance under this title to an otherwise eligible small business concern solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ). 6. State or local development company loans to finance cannabis-related legitimate businesses and service providers \nTitle V of the Small Business Investment Act of 1958 ( 15 U.S.C. 695 et seq. ) is amended by adding at the end the following: 511. Loans to finance cannabis-related legitimate businesses and service providers \n(a) Guarantees \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not decline to guarantee a debenture issued under this title for the purpose of making 1 or more loans to small business concerns solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ). (b) Other assistance \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), a qualified State or local development company may not decline an application for a loan under this title submitted by an otherwise eligible small business concern solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ).. 511. Loans to finance cannabis-related legitimate businesses and service providers \n(a) Guarantees \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the Administrator may not decline to guarantee a debenture issued under this title for the purpose of making 1 or more loans to small business concerns solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ). (b) Other assistance \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), a qualified State or local development company may not decline an application for a loan under this title submitted by an otherwise eligible small business concern solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in paragraph (38) of section 7(a) of the Small Business Act ( 15 U.S.C. 636(a) ). 7. Assistance from resource partners for cannabis-related legitimate businesses and service providers \n(a) Small business development centers \nSection 21(c) of the Small Business Act ( 15 U.S.C. 648(c) ) is amended by adding at the end the following: (9) Services for cannabis-related legitimate businesses and service providers \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), a small business development center may not decline to provide services to an otherwise eligible small business concern under this section solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in section 7(a)(38)).. (b) Women’s business centers \nSection 29 of the Small Business Act ( 15 U.S.C. 656 ) is amended by adding at the end the following: (p) Services for cannabis-Related legitimate businesses and service providers \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), a women’s business center may not decline to provide services to an otherwise eligible small business concern under this section solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in section 7(a)(38)).. (c) SCORE \nSection 8(b)(1)(B) of the Small Business Act ( 15 U.S.C. 637(b)(1)(B) ) is amended by adding at the end the following: Notwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), the head of the SCORE program established under this subparagraph may not decline to provide services to an otherwise eligible small business concern solely because the concern is a cannabis-related legitimate business or service provider (as defined in section 7(a)(38)).. (d) Veteran business outreach centers \nSection 32 of the Small Business Act ( 15 U.S.C. 657b ) is amended by adding at the end the following: (h) Services for cannabis-Related legitimate businesses and service providers \nNotwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), a Veteran Business Outreach Center may not decline to provide services to an otherwise eligible small business concern under this section solely because the small business concern is a cannabis-related legitimate business or service provider (as defined in section 7(a)(38)).. 8. Technical assistance providers \nIn addition to the programs covered by the amendments made by this Act, and notwithstanding any provision of the Controlled Substances Act ( 21 U.S.C. 801 et seq. ), a provider of financial or technical assistance under a program administered or funded by the Small Business Administration may not decline to provide such financial or technical assistance to an otherwise eligible small business concern (as defined in section 3 of the Small Business Act ( 15 U.S.C. 632 )) solely because the concern is a cannabis-related legitimate business or service provider (as defined in section 7(a)(38) of the Small Business Act ( 15 U.S.C. 636(a)(38) ). 9. Rulemaking \nNot later than 120 days after the date of enactment of this Act, the Administrator of the Small Business Administration shall issue or amend any rules, standard operating procedures, and other legal or policy guidance as necessary to carry out the requirements of this Act and the amendments made by this Act.", "text_length": 12200}
{"id": "117s231is", "congress": 117, "bill_type": "s", "bill_number": 231, "bill_version": "is", "title": "To direct the Administrator of the Federal Emergency Management Agency to develop guidance for firefighters and other emergency response personnel on best practices to protect them from exposure to PFAS and to limit and prevent the release of PFAS into the environment, and for other purposes.", "sections": [{"text": "1. Short title \nThis Act may be cited as the Protecting Firefighters from Adverse Substances Act or the PFAS Act.", "id": "S1", "header": "Short title"}, {"text": "2. Guidance on how to prevent exposure to and release of PFAS \n(a) In general \nNot later than 180 days after the date of enactment of this Act, the Administrator of the Federal Emergency Management Agency, in consultation with the Administrator of the United States Fire Administration, the Administrator of the Environmental Protection Agency, the Director of the National Institute for Occupational Safety and Health, and the heads of any other relevant agencies, shall— (1) develop and publish guidance for firefighters and other emergency response personnel on training, education programs, and best practices to— (A) reduce the exposure to per- and polyfluoroalkyl substances (commonly referred to as PFAS ) from firefighting foam and personal protective equipment; and (B) limit or prevent the release of PFAS from firefighting foam into the environment; (2) develop and issue guidance to firefighters and other emergency response personnel on alternative foams, personal protective equipment, and other firefighting tools and equipment that do not contain PFAS; and (3) create an online public repository, which shall be updated on a regular basis, on tools and best practices for firefighters and other emergency response personnel to reduce, limit, and prevent the release of and exposure to PFAS. (b) Required consultation \nIn developing the guidance required under subsection (a), the Administrator of the Federal Emergency Management Agency shall consult with appropriate interested entities, including— (1) firefighters and other emergency response personnel, including national fire service and emergency response organizations; (2) impacted communities dealing with PFAS contamination; (3) scientists, including public and occupational health and safety experts, who are studying PFAS and PFAS alternatives in firefighting foam; (4) voluntary standards organizations engaged in developing standards for firefighter and firefighting equipment; (5) State fire training academies; (6) State fire marshals; (7) manufacturers of firefighting tools and equipment; and (8) any other relevant entities, as determined by the Administrator of the Federal Emergency Management Agency and the Administrator of the United States Fire Administration. (c) Review of guidance \nNot later than 3 years after the date on which the guidance required under subsection (a) is issued, and not less frequently than once every 2 years thereafter, the Administrator of the Federal Emergency Management Agency, in consultation with the Administrator of the United States Fire Administration, the Administrator of the Environmental Protection Agency, and the Director of the National Institute for Occupational Safety and Health, shall review the guidance and, as appropriate, issue updates to the guidance. (d) Applicability of FACA \nThe Federal Advisory Committee Act (5 U.S.C. App.) shall not apply to this Act.", "id": "id50B539A4333C4A8AA186AFD76A1BDD2A", "header": "Guidance on how to prevent exposure to and release of PFAS"}], "sections_length": 2, "text": "1. Short title \nThis Act may be cited as the Protecting Firefighters from Adverse Substances Act or the PFAS Act. 2. Guidance on how to prevent exposure to and release of PFAS \n(a) In general \nNot later than 180 days after the date of enactment of this Act, the Administrator of the Federal Emergency Management Agency, in consultation with the Administrator of the United States Fire Administration, the Administrator of the Environmental Protection Agency, the Director of the National Institute for Occupational Safety and Health, and the heads of any other relevant agencies, shall— (1) develop and publish guidance for firefighters and other emergency response personnel on training, education programs, and best practices to— (A) reduce the exposure to per- and polyfluoroalkyl substances (commonly referred to as PFAS ) from firefighting foam and personal protective equipment; and (B) limit or prevent the release of PFAS from firefighting foam into the environment; (2) develop and issue guidance to firefighters and other emergency response personnel on alternative foams, personal protective equipment, and other firefighting tools and equipment that do not contain PFAS; and (3) create an online public repository, which shall be updated on a regular basis, on tools and best practices for firefighters and other emergency response personnel to reduce, limit, and prevent the release of and exposure to PFAS. (b) Required consultation \nIn developing the guidance required under subsection (a), the Administrator of the Federal Emergency Management Agency shall consult with appropriate interested entities, including— (1) firefighters and other emergency response personnel, including national fire service and emergency response organizations; (2) impacted communities dealing with PFAS contamination; (3) scientists, including public and occupational health and safety experts, who are studying PFAS and PFAS alternatives in firefighting foam; (4) voluntary standards organizations engaged in developing standards for firefighter and firefighting equipment; (5) State fire training academies; (6) State fire marshals; (7) manufacturers of firefighting tools and equipment; and (8) any other relevant entities, as determined by the Administrator of the Federal Emergency Management Agency and the Administrator of the United States Fire Administration. (c) Review of guidance \nNot later than 3 years after the date on which the guidance required under subsection (a) is issued, and not less frequently than once every 2 years thereafter, the Administrator of the Federal Emergency Management Agency, in consultation with the Administrator of the United States Fire Administration, the Administrator of the Environmental Protection Agency, and the Director of the National Institute for Occupational Safety and Health, shall review the guidance and, as appropriate, issue updates to the guidance. (d) Applicability of FACA \nThe Federal Advisory Committee Act (5 U.S.C. App.) shall not apply to this Act.", "text_length": 3015}
{"id": "117s1266is", "congress": 117, "bill_type": "s", "bill_number": 1266, "bill_version": "is", "title": "To amend the Internal Revenue Code of 1986 to expand the renewable electricity production credit to include electricity produced from hydrogen.", "sections": [{"text": "1. Short title \nThis Act may be cited as the Hydrogen Utilization and Sustainability Act.", "id": "S1", "header": "Short title"}, {"text": "2. Expansion of renewable electricity production credit to include electricity produced from hydrogen \n(a) In general \nSection 45 of the Internal Revenue Code of 1986 is amended— (1) in subsection (c)— (A) in paragraph (1)— (i) in subparagraph (H), by striking and at the end; (ii) in subparagraph (I), by striking the period at the end and inserting , and ; and (iii) by adding at the end the following new subparagraph: (J) qualified hydrogen. ; and (B) by adding at the end the following new paragraph: (11) Qualified hydrogen \nThe term qualified hydrogen means, with respect to any taxable year, hydrogen fuel which has been certified prior to such year by the Secretary of Energy (in consultation with the Secretary) as having a carbon intensity of not greater than 75 grams of CO 2 e per kilowatt hour of electricity produced, as determined based on a lifecycle analysis. ; and (2) in subsection (d), by adding at the end the following new paragraph: (12) Hydrogen facility \n(A) In general \nIn the case of a facility using qualified hydrogen to produce electricity, the term qualified facility means any facility owned by the taxpayer— (i) for which not less than 70 percent of the electricity produced at such facility during any taxable year is attributable to the use of qualified hydrogen, and (ii) (I) the construction of which begins before January 1, 2024, or (II) which— (aa) was originally placed in service before the date of enactment of this paragraph and, prior to the modification described in item (bb), did not use hydrogen to produce electricity, and (bb) before January 1, 2024, is modified to use qualified hydrogen to produce electricity. (B) Modification \nFor purposes of subparagraph (A)(ii)(II)(bb), a facility shall be treated as modified before January 1, 2024, if the construction of such modification begins before such date. (C) Election \nIf the owner of the facility described in subparagraph (A) makes an election under this subparagraph in such time and manner as the Secretary may prescribe by regulations, the credit under this section— (i) shall be allowable to the person that leases and operates such facility, and (ii) shall not be allowable to the owner of such facility. (D) Special rules \n(i) Exclusion of electricity not produced from qualified hydrogen \nFor purposes of subsection (a)(2), the total amount of kilowatt hours of electricity produced by the taxpayer at a qualified facility described in subparagraph (A) for any taxable year shall be equal to the product of— (I) the total amount of kilowatt hours of electricity produced by the taxpayer at such facility for such taxable year, multiplied by (II) an amount equal to the quotient of— (aa) the amount of qualified hydrogen used at such facility to produce such electricity (as determined on the basis of Btu content), divided by (bb) the total amount of fuel used at such facility to produce such electricity (as determined on the basis of Btu content). (ii) Adjustment for negative carbon intensity \n(I) In general \nFor purposes of subsection (a)(2), the total amount of kilowatt hours of electricity produced by the taxpayer at a qualified facility described in subparagraph (A) for any taxable year (as determined after application of clause (i)) shall be increased by an amount equal to the applicable percentage of such total amount. (II) Applicable percentage \nFor purposes of subclause (I), the applicable percentage for a qualified facility for any taxable year is the amount (expressed as a percentage) equal to the product of— (aa) 1 percentage point, multiplied by (bb) an amount equal to the quotient of— (AA) the total amount of carbon dioxide (expressed in metric tons) which is removed from the atmosphere during such taxable year through the use of qualified hydrogen (as determined pursuant to a certification of negative carbon intensity for such hydrogen under subsection (c)(11)) at such qualified facility, divided by (BB) 1,000.. (b) Effective date \nThe amendments made by this section shall take effect on the date of enactment of this Act.", "id": "idEB0EF3BB9D484B7089DEB08A67F496A7", "header": "Expansion of renewable electricity production credit to include electricity produced from hydrogen"}], "sections_length": 2, "text": "1. Short title \nThis Act may be cited as the Hydrogen Utilization and Sustainability Act. 2. Expansion of renewable electricity production credit to include electricity produced from hydrogen \n(a) In general \nSection 45 of the Internal Revenue Code of 1986 is amended— (1) in subsection (c)— (A) in paragraph (1)— (i) in subparagraph (H), by striking and at the end; (ii) in subparagraph (I), by striking the period at the end and inserting , and ; and (iii) by adding at the end the following new subparagraph: (J) qualified hydrogen. ; and (B) by adding at the end the following new paragraph: (11) Qualified hydrogen \nThe term qualified hydrogen means, with respect to any taxable year, hydrogen fuel which has been certified prior to such year by the Secretary of Energy (in consultation with the Secretary) as having a carbon intensity of not greater than 75 grams of CO 2 e per kilowatt hour of electricity produced, as determined based on a lifecycle analysis. ; and (2) in subsection (d), by adding at the end the following new paragraph: (12) Hydrogen facility \n(A) In general \nIn the case of a facility using qualified hydrogen to produce electricity, the term qualified facility means any facility owned by the taxpayer— (i) for which not less than 70 percent of the electricity produced at such facility during any taxable year is attributable to the use of qualified hydrogen, and (ii) (I) the construction of which begins before January 1, 2024, or (II) which— (aa) was originally placed in service before the date of enactment of this paragraph and, prior to the modification described in item (bb), did not use hydrogen to produce electricity, and (bb) before January 1, 2024, is modified to use qualified hydrogen to produce electricity. (B) Modification \nFor purposes of subparagraph (A)(ii)(II)(bb), a facility shall be treated as modified before January 1, 2024, if the construction of such modification begins before such date. (C) Election \nIf the owner of the facility described in subparagraph (A) makes an election under this subparagraph in such time and manner as the Secretary may prescribe by regulations, the credit under this section— (i) shall be allowable to the person that leases and operates such facility, and (ii) shall not be allowable to the owner of such facility. (D) Special rules \n(i) Exclusion of electricity not produced from qualified hydrogen \nFor purposes of subsection (a)(2), the total amount of kilowatt hours of electricity produced by the taxpayer at a qualified facility described in subparagraph (A) for any taxable year shall be equal to the product of— (I) the total amount of kilowatt hours of electricity produced by the taxpayer at such facility for such taxable year, multiplied by (II) an amount equal to the quotient of— (aa) the amount of qualified hydrogen used at such facility to produce such electricity (as determined on the basis of Btu content), divided by (bb) the total amount of fuel used at such facility to produce such electricity (as determined on the basis of Btu content). (ii) Adjustment for negative carbon intensity \n(I) In general \nFor purposes of subsection (a)(2), the total amount of kilowatt hours of electricity produced by the taxpayer at a qualified facility described in subparagraph (A) for any taxable year (as determined after application of clause (i)) shall be increased by an amount equal to the applicable percentage of such total amount. (II) Applicable percentage \nFor purposes of subclause (I), the applicable percentage for a qualified facility for any taxable year is the amount (expressed as a percentage) equal to the product of— (aa) 1 percentage point, multiplied by (bb) an amount equal to the quotient of— (AA) the total amount of carbon dioxide (expressed in metric tons) which is removed from the atmosphere during such taxable year through the use of qualified hydrogen (as determined pursuant to a certification of negative carbon intensity for such hydrogen under subsection (c)(11)) at such qualified facility, divided by (BB) 1,000.. (b) Effective date \nThe amendments made by this section shall take effect on the date of enactment of this Act.", "text_length": 4163}
{"id": "117sres226is", "congress": 117, "bill_type": "sres", "bill_number": 226, "bill_version": "is", "title": "Expressing the sense of the Senate that the United States supports Israel, our greatest ally in the region, and its right to defend itself against terrorist attacks.", "sections": [{"text": "That the Senate— (1) opposes the escalating and indiscriminate rocket attacks by Hamas against Israel; (2) mourns the loss of innocent life caused by Hamas’ rocket attacks; (3) urges continued and steadfast support for Israel, because we have no greater ally in our efforts to preserve peace and secure our interests in the Middle East; (4) affirms its unwavering commitment to our ally, Israel, and its right to defend itself and its civilians against terror by whatever means necessary to stop the murder of Israeli citizens and foreign nationals residing in Israel; (5) supports and stands with Israel as it defends its people from these reprehensible terrorist attacks; and (6) reaffirms its strong support for Israel’s right to peace and security.", "id": "S1", "header": null}], "sections_length": 1, "text": "That the Senate— (1) opposes the escalating and indiscriminate rocket attacks by Hamas against Israel; (2) mourns the loss of innocent life caused by Hamas’ rocket attacks; (3) urges continued and steadfast support for Israel, because we have no greater ally in our efforts to preserve peace and secure our interests in the Middle East; (4) affirms its unwavering commitment to our ally, Israel, and its right to defend itself and its civilians against terror by whatever means necessary to stop the murder of Israeli citizens and foreign nationals residing in Israel; (5) supports and stands with Israel as it defends its people from these reprehensible terrorist attacks; and (6) reaffirms its strong support for Israel’s right to peace and security.", "text_length": 752}
